package com.shildt.glava_07;

//*************************************************************************************
//********************************** НЕ ЗНАЛ ******************************************
//*************************************************************************************

class VarArgs {
    // Теперь метод vaTest() объявляется с аругментами переменной длинны
    static void vaTest(int ... v) {
        System.out.print("Количество аругментов: " + v.length + " Содержимое: ");

        for (int x : v) {
            System.out.print(x + " ");
        }
        System.out.println();
    }

    public static void main(String[] args) {
        vaTest(10);
        vaTest(1, 2, 3);
        vaTest();

    }
}
